app/controllers/api/users_controller.rb

  def search
    search_typehead = params[:q]
    @search = User.where('first_name LIKE :search OR '\
                           'last_name LIKE :search OR '\
                           'email LIKE :search', search: "%#{search_typehead}%")
---
SELECT "users".* FROM "users" WHERE (first_name ILIKE '%iss%' OR last_name ILIKE '%iss%' OR email ILIKE '%iss%')

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email") VALUES (?, ?, ?)  [["first_name", "test"], ["last_name", "smith"], ["email", "smith@gmail.com"]]

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "email" = ? WHERE "users"."id" = ?  [["first_name", "John1"], ["last_name", "Pandey1"], ["email", "john.pandey@gmail.com"], ["id", 1]]